wellin265/esp32_linux_demo/ks_demo/03.development.usb_4g_module/sdkconfig.ci.esp32s3_usb_otg
CONFIG_ESP32_S3_USB_OTG=y
CONFIG_EXAMPLE_ENABLE_WEB_ROUTER=y

# Codex unified esp32s3 defaults

# Codex unified esp32s3 defaults
CONFIG_IDF_TARGET_ARCH_XTENSA=y
CONFIG_IDF_TARGET_ARCH="xtensa"
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_I2C_MASTER_SCL=18
CONFIG_I2C_MASTER_SDA=17
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_FATFS_LFN_STACK=y
CONFIG_FREERTOS_HZ=1000
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
